snlkuharlocal/src/Documents/КорректировкаЦенВНакладной/КорректировкаЦенВНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаЦенВНакладной</name>
  <comment>Корректировка цен в накладной</comment>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиТМЦКомиссия</registerRecords>
  <registerRecords>AccumulationRegister.Профит</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТМЦ</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.АктПриемки</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРекламации</name>
    <type>
      <types>CatalogRef.ПричиныРекламаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьПоОстаткам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРекламации</name>
    <type>
      <types>EnumRef.ВидыРекламаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ВидыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеКоррекции</name>
    <type>
      <types>EnumRef.СостоянияКоррекции</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработал</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Скан</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСкидкаНаНакладную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенРаспродажа</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВРНК</name>
    <type>
      <types>EnumRef.УчитыватьВРНК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСкидкиДС</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСкидкиДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладКомиссия</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКомиссия</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <comment>Скидка %</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИсх</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаФактБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Акция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРекламации</name>
      <type>
        <types>CatalogRef.ПричиныРекламаций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШКМаркиКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУКонтрагента</name>
      <type>
        <types>EnumRef.СтатусыМарокУКонтаргента</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>количество штук в маркировке (короб это или штука)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/УчитыватьВычеркиВТорг12/УчитыватьВычеркиВТорг12.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчитыватьВычеркиВТорг12</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>EnumRef.УчитыватьВРНК</types>
    </type>
  </resources>
  <resources>
    <name>ДатаУстановкиРеквизита</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.СчетФактура</types>
      <types>DocumentRef.КорректировкаЦенВНакладной</types>
      <types>DocumentRef.КорректировочныйСчетФактура</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/AccumulationRegisters/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Затраты</name>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЛогистика</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбыта</name>
    <type>
      <types>CatalogRef.КаналСбыта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КапитальныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/КорректировкаЦенВНакладной/ObjectModule.bsl
// Катаев+ 19/03/13
Перем мСозданиеНевозможно Экспорт;
// Катаев- 19/03/13
//Катаев+ 06/10/14
Перем НужноВыгружать;
//Катаев- 06/10/14

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		НаборЗаписей.Очистить();
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры 


//нечаева 22,11,16+++
Функция ПолучитьДанныеРегистраУчитыватьВычерки(Док) Экспорт
	
	УчитыватьВРНк = Перечисления.УчитыватьВРНК.ПустаяСсылка();
	
	запрос  = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	УчитыватьВычеркиВТорг12.Значение
	|ИЗ
	|	РегистрСведений.УчитыватьВычеркиВТорг12 КАК УчитыватьВычеркиВТорг12
	|ГДЕ
	|	УчитыватьВычеркиВТорг12.Документ.ссылка = &Документ";
	
	Запрос.УстановитьПараметр("Документ",Док.ссылка);
	Рез = Запрос.Выполнить().выбрать();
	Если Рез.Следующий() Тогда
		УчитыватьВРНК = Рез.Значение;
	КонецЕсли;
	
	возврат учитыватьВРНК;
	
КонецФункции
//нечаева 22,11,16---


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	#Если клиент Тогда
		Если (Отработано ) и ПометкаУдаления Тогда
			Сообщить("Невозможно удалить корректировку цен в состоянии  Отработано.");
			Отказ=истина;
			возврат;
		КонецЕсли;	
	#КонецЕсли 
	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	ЕстьИзменения		= Модифицированность();
	НужноВыгружать		= НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
		//Если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение  Тогда
		//	СообщитьОбОшибке("Рекламационные накладные по ценам вводятся только в ЦО !!!");
		//	Отказ=Истина;
		//КонецЕсли;
		
		
		//нечаева 17,11,16+++
		#Если Клиент Тогда
			
			
			////нечаева 26,12,16+++
			//Если ПараметрыСеанса.ЭтотУзел.Код = "SNL" и РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			//	сообщить("РКМ и КЦН проводятся только на складе!");
			//	отказ = истина;
			//	возврат;
			//КонецЕсли;	
			////нечаева 26,12,16---
			//	
			
			//
			//Если
			//	РежимЗаписи=РежимЗаписиДокумента.Проведение
			//	И Дата<ТекущаяДата() И Дата >= Константы.ДатаЗапретаРедактирования.Получить()
			//	// и не закрыт период вычерка
			//	Тогда
			//	Ответ=Вопрос("КЦН корректируются только на текущую дату ! Изменить дату на текущую ?",РежимДиалогаВопрос.ОКОтмена);
			//	Если Ответ=КодВозвратаДиалога.ОК Тогда
			//		Дата=ТекущаяДата();
			//	Иначе
			//		Отказ=Истина;					
			//		Возврат;		
			//	КонецЕсли; 
			//	
			//иначе
			//	Дата=ТекущаяДата();
			//КонецЕсли;
			//
			//Если КонецДня(Дата) > КонецДня(ТекущаяДата()) И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			//	Сообщить("Невозможно проведение будущей датой");
			//	Отказ = Истина;
			//КонецЕсли;
			
		#КонецЕсли
		
		//нечаева 17,11,16---
		
		
		
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;
	
	Если ЕстьИзменения Тогда		
		СуммаДокумента		= Товары.Итог("Всего");
		ОбъемДокумента		= Товары.Итог("Объем");
		КоличествоДокумента = Товары.Итог("Количество");
		
		ГруппыТоваров   	= ГруппыТоваровДокумента(ЭтотОбъект);
	КонецЕсли; 
	// 04,03, 2014	 +++
	//// только для согласованных
	//Если НужноВыгружать и Согласована Тогда
	//	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	//КонецЕсли;
	
	
	//// 31,03, 2014 +++ нечаева
	// только для согласованных
	Если НужноВыгружать Тогда
		Если ПараметрыСеанса.ТипУзла<>Перечисления.ТипУзлаИБ.УправляющееПодразделение  Тогда
			//из филиалов
			УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
		Иначе
			// Из Цо 
			//Катаев+ 21/08/14 Если  Согласована Тогда
			Если СостояниеКоррекции = Перечисления.СостоянияКоррекции.Отклонена Или СостояниеКоррекции = Перечисления.СостоянияКоррекции.Утверждена Тогда
				УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//// 31,03, 2014 ---  нечаева
	
	
	
	// нечаева 29,08,16+++
	//03.010.16++ для автомата не надо
	
	//нечаева 23,12,16+++
	Если НЕ ОбменДанными.Загрузка Тогда
		
		#Если клиент Тогда	
			
			// нечаева 23,08,16+++ проверим есть ли ксф, если нет, то создаем.
			КСФ=документы.КорректировочныйСчетФактура.ПустаяСсылка();
			
			КСФ=КСчетФактураНакладной(ЭтотОбъект.Ссылка,Организация);
			
			
			если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения и (Согласована) 
				и ВидРекламации=Перечисления.ВидыРекламаций.Вычерк  Тогда
				
				// нечаева 23,08,16+++ проверим есть ли ксф, если нет, то создаем.
				КСФ=документы.КорректировочныйСчетФактура.ПустаяСсылка();
				
				КСФ=КСчетФактураНакладной(ЭтотОбъект.Ссылка,Организация);
				
				Если НЕ КСФ.Пустая() Тогда
					// снимаем проведение
					КСФ_Объект=КСФ.ссылка.ПолучитьОбъект();
					Если ЭтотОбъект.ПометкаУдаления = истина Тогда
						КСФ_Объект.пометкаУдаления=Истина;
					КонецЕсли;	
					КСФ_Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения,РежимПроведенияДокумента.Неоперативный);
					
				КонецЕсли;		
				
			КонецЕсли;
			
			
			если РежимЗаписи=РежимЗаписиДокумента.Проведение и (Согласована) 
				и ВидРекламации=Перечисления.ВидыРекламаций.Вычерк  Тогда
				
				// нечаева 23,08,16+++ проверим есть ли ксф, если нет, то создаем.
				КСФ=документы.КорректировочныйСчетФактура.ПустаяСсылка();
				
				КСФ=КСчетФактураНакладной(ЭтотОбъект.Ссылка,Организация);
				//
				//Если НЕ КСФ.Пустая() Тогда
				//	// снимаем проведение
				//	КСФ_Объект=КСФ.ссылка.ПолучитьОбъект();
				//	КСФ_Объект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
				//	
				//КонецЕсли;	
				
				
				//нечаева 23,12,16 ++++
				// проводим, только при установленном значении КСФ
				ЗнРеквизита = ПолучитьДанныеРегистраУчитыватьВычерки(ЭтотОбъект);
				
				Если ЗнРеквизита = перечисления.УчитыватьВРНК.КСФ Тогда
					Если НЕ КСФ.Пустая()  Тогда
						// снимаем проведение
						КСФ_Объект=КСФ.ссылка.ПолучитьОбъект();
						//крохин нрачало 23.02.2017
						//грамматическая ошибка + проводим только непроведенные
						//Если КСФ_Объект.пометкаНаУдаление = Истина Тогда
						//	КСФ_Объект.пометкаНаУдаление = ложь;
						//КонецЕсли;
						//КСФ_Объект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
						Если КСФ_Объект.пометкаудаления Тогда
							КСФ_Объект.пометкаудаления = ложь;
						КонецЕсли;

						Если НЕ КСФ_Объект.Проведен Тогда
						КСФ_Объект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
						КонецЕсли;
						//крохин конец 23.02.2017
					КонецЕсли;		
				КонецЕсли;
				//нечаева 23,12,16 ----
										
				
			КонецЕсли;
			
			// нечаева 29,08,16+++
			Если НЕ КСФ.Пустая() Тогда
				Если КСФ.дата<> ЭтотОбъект.Ссылка.Дата Тогда
					КСФ_Объект=КСФ.ПолучитьОбъект();
					КСФ_Объект.Дата = ЭтотОбъект.Дата;
					КСФ_Объект.записать();
				КонецЕсли;
			КонецЕсли
			
			
			// нечаева 29,08,16 ---
		#КонецЕсли
		
	КонецЕсли;	
	//нечаева 23,12,16---
	
	//крохин начало 22.01.2020
	Если НЕ ОбменДанными.Загрузка Тогда
		Если ДокОснование.Метаданные().Имя = "РасходнаяНакладная" Тогда
			Если ДокОснование.СуммаСкидкиДС <> 0 Тогда
				СуммаСкидкиДСДоИзменения = ДокОснование.СуммаСкидкиДС;
				Если ДокОснование.СуммаДокумента <> 0 Тогда
				ПроцентИзмененияСкидкиДС = СуммаДокумента/ДокОснование.СуммаДокумента;
			Иначе
				ПроцентИзмененияСкидкиДС = 0;
			КонецЕсли;
			СуммаСкидкиДС = ПроцентИзмененияСкидкиДС*СуммаСкидкиДСДоИзменения;
			ДоговорСкидкиДС = ДокОснование.ДоговорСкидкиДС;
			КонецЕсли;
        КонецЕсли;
	КонецЕсли;
    //крохин конец 22.01.2020

	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Отработано=Ложь;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	
	Если НЕ ПроводитьПоОстаткам Тогда Возврат  КонецЕсли; 
	
	//для проведения РКМ/КЦН в ЦО
	Если НЕ ОбменДанными.Загрузка И НЕ ПараметрыСеанса.ЗапущенаОбработка Тогда
	
		#если клиент Тогда
		//по офисным складам можно делать РКМ
		Если ПараметрыСеанса.ЭтотУзел.Код = "SNL" И НЕ ПустаяСтрока(Склад.КодФизическогоУзла) Тогда	
				сообщить("РКМ и КЦН проводятся только на складе!");
				отказ = истина;
				возврат;		
			КонецЕсли;	
		#КонецЕсли
	КонецЕсли;
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	ДвиженияПоРегистрам=Неопределено;	
	Доллары				=Справочники.Валюты.НайтиПоКоду("840");
	Рубли				=Справочники.Валюты.НайтиПоКоду("810");
	Евро				=Справочники.Валюты.НайтиПоКоду("978");
	
	ВалютаУпр			=?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);
	КурсУпр				=ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Дата);
	
	//На регистре
	//СуммаВАЛ - сумма в валюте расчетов
	//СуммаУПР - сумма в упр валюте
	
	СтатьяЗатрат=Справочники.СтатьиЗатрат.НайтиПоКоду("321 410  ");
	
	
	// нечаева доработка для ПНК 02,07,14 +++
	
	ТекВид=ДокОснование.Метаданные().Имя;
	Если ТекВид<>"ПриходнаяНакладная" Тогда
		
		Если Дата < '20160201' ИЛИ ДокОснование.КодОперации <> Перечисления.КодыОперацийОстатки.Реализация Тогда
			СуммаВал					=  Модуль(товары.Итог("Всего"));
			СуммаУпр					=  Модуль(товары.Итог("Всего"));
			
			//ЗАТРАТЫ
			Движение 					= Движения.Затраты.Добавить();		
			
			Движение.ВидДвижения		= ?(товары.Итог("Всего")<0,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);				
			
			Движение.Период				= Дата;
			//++Данилова Е.В. 03.10.2025 HELP-7050 
			Если Дата >= дата(2025,09,01) Тогда
				
				Движение.Подразделение		= ?(ЗначениеЗаполнено(Подразделение),Подразделение,ДокОснование.Подразделение);
			Иначе 
				Движение.Подразделение		= ДокОснование.Подразделение;
			КонецЕсли;
			//Движение.Подразделение		= ДокОснование.Подразделение;
			//--Данилова Е.В. 03.10.2025			

			Движение.СтатьяЗатрат		= СтатьяЗатрат;
			
			Движение.СуммаУпр			= Модуль(СуммаУпр);		
			
			Движение.Контрагент			= ДокОснование.Контрагент.Ведущий;
			Движение.Договор			= ДокОснование.Договор;
			
			Движение.СуммаДокумента		= Модуль(товары.Итог("Всего"));
			Движение.ВалютаДокумента	= Валюта;	
			
			Движение.ПериодРасходов		= ДокОснование.Дата;
			
			Движение.Комментарий        = Комментарий;
			
			Движение.ДатаЗаписи			= ТекущаяДата();	
		Иначе
			
			ДвиженияПоРегистрам=Неопределено;	
			
			РезультатПроведения=ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоРегистрам,ОбменДанными.Загрузка);	
			
			Результат=РезультатПроведения["Результат"];
			
			
			Если Результат<0 И НЕ ОбменДанными.Загрузка Тогда 			
				Отказ=Не(ПолучитьПолномочиеПользователя("СписыватьВМинус"));
			КонецЕсли;
			
			
			Если Не Отказ Тогда
				ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,ОбменДанными.Загрузка);		
			КонецЕсли;
			
			
		КонецЕсли;
		
		
		//************************************************************************************************************************************************	
		//Взаиморасчеты
		Движение 					= Движения.Взаиморасчеты.Добавить();
		
		Движение.ВидДвижения		= ?(товары.Итог("Всего")<0,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);		
		
		Движение.Период				= Дата;
		Если Лев(ДокОснование.Ссылка,18) = "<Объект не найден>" Тогда
			Движение.Контрагент			= Корреспондент.Ведущий;
			Движение.Договор 			= Договор;	
		Иначе
			Движение.Контрагент			= ДокОснование.Контрагент.Ведущий;
			Движение.Договор 			= Докоснование.Договор;	
		КонецЕсли;
		движение.КодОперации        = перечисления.КодыОперацийОстатки.ВозвратОтПокупателя;
		
		Движение.СуммаВал			= Модуль(товары.Итог("Всего"));
		Движение.СуммаУпр			= Модуль(товары.Итог("Всего"));
		
		Движение.СуммаДокумента		= товары.Итог("Всего");
		Движение.ВалютаДокумента	= Валюта;	
		
		Движение.Дата_НачалаЗадолженности = ДокОснование.ДатаОплаты;
	Иначе
		// это для ПНК
		СуммаВал					= -Модуль(товары.Итог("Всего"));
		СуммаУпр					= -Модуль(товары.Итог("Всего"));
		
		//ЗАТРАТЫ
		Движение 					= Движения.Затраты.Добавить();		
		
		Движение.ВидДвижения		= ?(товары.Итог("Всего")<0,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);				
		
		Движение.Период				= Дата;
		//++Данилова Е.В. 03.10.2025 HELP-7050 
		Если Дата >= дата(2025,09,01) Тогда
		
			Движение.Подразделение		= ?(ЗначениеЗаполнено(Подразделение),Подразделение,ДокОснование.Подразделение);
		Иначе 
			Движение.Подразделение		= ДокОснование.Подразделение;
		КонецЕсли;
		//Движение.Подразделение		= ДокОснование.Подразделение;
		//--Данилова Е.В. 03.10.2025
		Движение.СтатьяЗатрат		= СтатьяЗатрат;
		
		Движение.СуммаУпр			= - Модуль(СуммаУпр);		
		
		Движение.Контрагент			= ДокОснование.Контрагент.Ведущий;
		Движение.Договор			= ДокОснование.Договор;
		
		Движение.СуммаДокумента		= товары.Итог("Всего");
		Движение.ВалютаДокумента	= Валюта;	
		
		Движение.ПериодРасходов		= ДокОснование.Дата;
		
		Движение.Комментарий        = Комментарий;
		
		Движение.ДатаЗаписи			= ТекущаяДата();		
		
		
		//************************************************************************************************************************************************	
		//Взаиморасчеты
		Движение 					= Движения.Взаиморасчеты.Добавить();
		
		Движение.ВидДвижения		= ?(товары.Итог("Всего")<0,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);		
		
		Движение.Период				= Дата;
		Движение.Контрагент			= ДокОснование.Контрагент.Ведущий;
		Движение.Договор 			= Докоснование.Договор;	
		движение.КодОперации        = перечисления.КодыОперацийОстатки.ВозвратОтПокупателя;
		
		Движение.СуммаВал			= - Модуль(товары.Итог("Всего"));
		Движение.СуммаУпр			= - Модуль(товары.Итог("Всего"));
		
		Движение.СуммаДокумента		= товары.Итог("Всего");
		Движение.ВалютаДокумента	= Валюта;	
		
	конецЕсли;
	
	//при заполнении "суммы скидки" формируются доп. проводки
	ВалютаУпр=Константы.ВалютаУпрУчета_2009.Получить();
	
		Если  СуммаСкидкиДС <> 0 Тогда

		Запись=Движения.Взаиморасчеты.Добавить();                                          
							Запись.Период			=Дата;
							Запись.Активность		=Истина;
							Запись.ВидДвижения		=ВидДвиженияНакопления.Расход;
							
							Запись.СуммаУпр			=глПересчет(СуммаСкидкиДС,Валюта,Курс,ВалютаУпр,Дата);
							Запись.СуммаВал			=глПересчет(СуммаСкидкиДС,Валюта,Курс,ВалютаУпр,Курс);
							
							Запись.Контрагент		=Корреспондент.Ведущий;		
							Запись.Договор			=ДоговорСкидкиДС;
							
							Запись.СуммаДокумента	=СуммаДокумента;
							Запись.ВалютаДокумента	=Валюта;
	
		КонецЕсли;	 				
	Если СуммаСкидкиДС <> 0 Тогда
            Движение=Движения.Затраты.Добавить();
			
			Движение.Период			= Дата;
			
			Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;		
			
			//++Данилова Е.В. 03.10.2025 HELP-7050 
			Если Дата >= дата(2025,09,01) Тогда
				
				Движение.Подразделение		= ?(ЗначениеЗаполнено(Подразделение),Подразделение,ДокОснование.Подразделение);
			Иначе 
				Движение.Подразделение		= ДокОснование.Подразделение;
			КонецЕсли;
			//Движение.Подразделение		= ДокОснование.Подразделение;
			//--Данилова Е.В. 03.10.2025			
			
			Движение.СтатьяЗатрат	= Справочники.СтатьиЗатрат.НайтиПоКоду("320 570"); //Трейд-маркетинг
			
			Движение.СуммаУпр		= глПересчет(СуммаСкидкиДС, Валюта, Курс, ВалютаУпр, Дата);	
			
			Движение.СуммаДокумента	= СуммаДокумента;
			
			Движение.ВалютаДокумента= Валюта;
			
			Движение.Комментарий    = "скидка по ДС";

			
			Движение.ДатаЗаписи		= ТекущаяДата();
	КонецЕсли;		

	Если ОбменДанными.Загрузка тогда
		Движения.Взаиморасчеты.Записать();
		Движения.Затраты.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;	
	
	ВидОснования	= Основание.Метаданные().Имя;
	ДокОснование	= Основание;
	
	//Нечаева 15,01,14  +++
	Если ВидОснования="Перемещение" Тогда 
		Если КонецДня(Константы.ДатаЗапретаРедактирования.Получить()) >= ДокОснование.Дата Тогда
			//ВидРекламации=Перечисления.ВидыРекламаций.Вычерк 
			Сообщить("Не возможно создание Вычерка на основании документа Перемещение");
			мСозданиеНевозможно=Истина;
		КонецЕсли;
	КонецЕсли;
	//Нечаева 15,01,14  ---
	
	
	
	
	//Нечаева 03,07,14  +++
	Если ВидОснования="ПриходнаяНакладная" и основание.кодоперации<>перечисления.КодыОперацийОстатки.ВозвратОтПокупателя Тогда 
		Если КонецДня(Константы.ДатаЗапретаРедактирования.Получить()) >= ДокОснование.Дата Тогда
			//ВидРекламации=Перечисления.ВидыРекламаций.Вычерк 
			Сообщить("Не возможно создание Вычерка на основании документа Приходная Накладная с типом не равным - Возврат от покупателя");
			мСозданиеНевозможно=Истина;
		иначе
			Сообщить("Не возможно создание КЦН в открытом периоде");
			мСозданиеНевозможно=Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ВидОснования="ПриходнаяНакладная" и Докоснование.кодоперации=перечисления.КодыОперацийОстатки.ВозвратОтПокупателя Тогда 
		Если КонецДня(Константы.ДатаЗапретаРедактирования.Получить()) < ДокОснование.Дата Тогда
			Сообщить("Не возможно создание КЦН в открытом периоде");
			мСозданиеНевозможно=Истина;
		КонецЕсли;
	КонецЕсли;
	//Нечаева 03,07,14  ---
	
	
	
	
	
	//
	//
	//Если КонецДня(Константы.ДатаЗапретаРедактирования.Получить()) >= ДокОснование.Дата Тогда
	//	Сообщить("Корректировка проводится только для документов в закрытом периоде!");
	//	мСозданиеНевозможно=Истина;
	//КонецЕсли;
	
	
	ПунктДоставки	= ПолучитьРеквизитОбъекта(ДокОснование,"ПунктДоставки");			
	Менеджер 		= ПолучитьРеквизитОбъекта(ДокОснование,"Менеджер");			
	Организация		= ПолучитьРеквизитОбъекта(ДокОснование,"Организация");	
	ТипЦен			= ПолучитьРеквизитОбъекта(ДокОснование,"ТипЦен");
	ТипСкидок		= ПолучитьРеквизитОбъекта(ДокОснование,"ТипСкидок");
	ТипЦенРаспродажа	= ПолучитьРеквизитОбъекта(ДокОснование,"ТипЦенРаспродажа");
	СкидкаФакт			= ПолучитьРеквизитОбъекта(ДокОснование,"Скидка");
	ДопСкидкаНаНакладную = ПолучитьРеквизитОбъекта(ДокОснование,"ДопСкидкаНаНакладную"); 
	//++Данилова Е.В. 03.10.2025 HELP-7050 
	Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Менеджер); 
	Если НЕ ЗначениеЗаполнено(Подразделение)
		И ЕстьРеквизитДокумента("Подразделение",Докоснование.Метаданные()) Тогда
	
		Подразделение = ДокОснование.Подразделение; 	
	
	КонецЕсли;
	//--Данилова Е.В. 03.10.2025
	
	//менеджер, для отчета "продажи"
	Менеджер			= ПолучитьРеквизитОбъекта(ДокОснование,"Менеджер");
	//крохин конец 29.01.2013
	
	Комментарий		= ""+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy");		
	
	Если ВидОснования="ПриходнаяНакладная" ИЛИ ВидОснования="РасходнаяНакладная" Тогда
		Корреспондент	= ДокОснование.Контрагент;		
		Склад			= ДокОснование.Склад;
		//крохин начало 06.03.2012
		ВидОплаты = ДокОснование.ВидОплаты;
		//крохин конец 06.03.2012
		//крохин начало 24.05.2012
		ДатаОплаты = Докоснование.ДатаОплаты;
		//крохин конец 24.05.2012
		
		//крохин начало 28.04.2020
		Договор = ДокОснование.Договор;
		//крохин конец 28.04.2020
	ИначеЕсли ВидОснования="Перемещение" Тогда
		Корреспондент	= ДокОснование.СкладПолучатель;
		Склад			= ДокОснование.Склад;
		// Катаев+ 19/03/13 
	ИначеЕсли Видоснования="АктПриемки"	 Тогда
		Корреспондент	= ДокОснование.Контрагент;		
		Склад			= ДокОснование.Склад;
		ДатаОплаты = ДокОснование.РНК.ДатаОплаты;
		//Катаев- 19/03/13
	Иначе
		Склад			= ПолучитьРеквизитОбъекта(ДокОснование,"Склад");		
	КонецЕсли;	
	
	Если ВидОснования="ПриходнаяНакладная" И ДокОснование.КодОперации=Перечисления.КодыОперацийОстатки.ЗакупкаР Тогда
		Поставщику=Истина;
		
		Для Каждого ИсхСтрокаТЧ ИЗ ДокОснование.Товары Цикл
			Если ИсхСтрокаТЧ.ПодтвержденнаяЗаявка<>ИсхСтрокаТЧ.Количество Тогда
				СтрокаТЧ=Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,ИсхСтрокаТЧ,,"Количество");
				
				СтрокаТЧ.ЦенаИсх	=ИсхСтрокаТЧ.Цена;
				СтрокаТЧ.ЦенаФакт	=ИсхСтрокаТЧ.Цена;
				СтрокаТЧ.ЦенаФактБезСкидки	=ИсхСтрокаТЧ.ЦенаБезСкидки;
				СтрокаТЧ.СкидкаФакт	=ИсхСтрокаТЧ.Скидка;
				СтрокаТЧ.Цена		=СтрокаТЧ.ЦенаФакт-СтрокаТЧ.ЦенаИсх;				
				СтрокаТЧ.ЦенаБезСкидки=СтрокаТЧ.Цена;				
				
				РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект);
			КонецЕсли; 			
		КонецЦикла;
	ИначеЕсли ВидОснования="Перемещение" Тогда
		Для Каждого ИсхСтрокаТЧ ИЗ ДокОснование.Товары Цикл
			Если ИсхСтрокаТЧ.ПодтвержденнаяЗаявка<>ИсхСтрокаТЧ.Количество Тогда
				СтрокаТЧ=Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧ,ИсхСтрокаТЧ,,"Количество");
				
				СтрокаТЧ.ЦенаИсх	=ИсхСтрокаТЧ.Цена;
				СтрокаТЧ.ЦенаФактБезСкидки	=ИсхСтрокаТЧ.ЦенаБезСкидки;
				СтрокаТЧ.СкидкаФакт	=ИсхСтрокаТЧ.Скидка;
				СтрокаТЧ.ЦенаФакт	=ИсхСтрокаТЧ.Цена;
				СтрокаТЧ.Цена		=СтрокаТЧ.ЦенаИсх-СтрокаТЧ.ЦенаФакт;				
				СтрокаТЧ.ЦенаБезСкидки=СтрокаТЧ.Цена;				
				
				РассчитатьСуммуТабЧасти(СтрокаТЧ,ЭтотОбъект);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	//02,07,14 +++ нечаева добавила ПНК
	Если ( ВидОснования="РасходнаяНакладная" или  ВидОснования="ПриходнаяНакладная") И КонецДня(Константы.ДатаЗапретаРедактирования.Получить()) >= ДокОснование.Дата Тогда
		ВидРекламации = Перечисления.ВидыРекламаций.Вычерк;
	Иначе
		Отказ=истина;
		ВидРекламации =Перечисления.ВидыРекламаций.Рекламация;
	КонецЕсли;
	//02,07,14 --- нечаева добавила ПНК
	
	//крохин начало 05.05.2020
	//комиссионная торговля
	Если ВидОснования="РасходнаяНакладная" И  ДокОснование.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
	СкладКомиссия = ДокОснование.СкладКомиссия;
	//ДоговорКомиссия = ДокОснование.ДоговорКомиссия;
	КонецЕсли;
	//крохин конец 05.05.2020
	
	
КонецПроцедуры


Процедура ПередУдалением(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//Нечаева 27,01,14 +++ 
	
	#Если клиент Тогда
		
		Если Отработано Тогда
			Сообщить("Невозможно удалить коррекцию цен в состоянии Отработано.");
			Отказ=истина;
		КонецЕсли;	
	#КонецЕсли 
	//Нечаева 27,01,14  ----
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
